{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.4.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_3", "layers": [{"class_name": "Conv2D", "config": {"name": "conv2d_18", "trainable": true, "batch_input_shape": [null, 200, 200, 3], "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_19", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_9", "trainable": true, "dtype": "float32", "pool_size": [4, 4], "padding": "valid", "strides": [4, 4], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_15", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_20", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_21", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_10", "trainable": true, "dtype": "float32", "pool_size": [4, 4], "padding": "valid", "strides": [4, 4], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_16", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_22", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_23", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_11", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_17", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Flatten", "config": {"name": "flatten_3", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_12", "trainable": true, "dtype": "float32", "units": 4096, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_13", "trainable": true, "dtype": "float32", "units": 4096, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_14", "trainable": true, "dtype": "float32", "units": 1000, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_15", "trainable": true, "dtype": "float32", "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": ["accuracy"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of10.bin", "group1-shard2of10.bin", "group1-shard3of10.bin", "group1-shard4of10.bin", "group1-shard5of10.bin", "group1-shard6of10.bin", "group1-shard7of10.bin", "group1-shard8of10.bin", "group1-shard9of10.bin", "group1-shard10of10.bin"], "weights": [{"name": "conv2d_18/kernel", "shape": [3, 3, 3, 32], "dtype": "float32", "quantization": {"min": -0.18417109730196934, "scale": 0.0013744111738952936, "dtype": "uint8"}}, {"name": "conv2d_18/bias", "shape": [32], "dtype": "float32", "quantization": {"min": -0.02738789466081881, "scale": 0.00029769450718281315, "dtype": "uint8"}}, {"name": "conv2d_19/kernel", "shape": [3, 3, 32, 32], "dtype": "float32", "quantization": {"min": -0.21944139003753663, "scale": 0.0016135396326289457, "dtype": "uint8"}}, {"name": "conv2d_19/bias", "shape": [32], "dtype": "float32", "quantization": {"min": -0.018646012772532073, "scale": 0.00015283617026665632, "dtype": "uint8"}}, {"name": "conv2d_20/kernel", "shape": [3, 3, 32, 64], "dtype": "float32", "quantization": {"min": -0.2071487345531875, "scale": 0.0015120345587823906, "dtype": "uint8"}}, {"name": "conv2d_20/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.04167812234338592, "scale": 0.00017964707906631863, "dtype": "uint8"}}, {"name": "conv2d_21/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"min": -0.14626059321796192, "scale": 0.0011988573214587043, "dtype": "uint8"}}, {"name": "conv2d_21/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.0288914435470075, "scale": 0.00011938613035953512, "dtype": "uint8"}}, {"name": "conv2d_22/kernel", "shape": [3, 3, 64, 128], "dtype": "float32", "quantization": {"min": -0.21817486882209777, "scale": 0.0014259795347849528, "dtype": "uint8"}}, {"name": "conv2d_22/bias", "shape": [128], "dtype": "float32", "quantization": {"min": -0.024666558615132873, "scale": 0.00012780600318721696, "dtype": "uint8"}}, {"name": "conv2d_23/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"min": -0.1432581193306867, "scale": 0.001093573430005242, "dtype": "uint8"}}, {"name": "conv2d_23/bias", "shape": [128], "dtype": "float32", "quantization": {"min": -0.029822342755163416, "scale": 0.00012425976147984757, "dtype": "uint8"}}, {"name": "dense_12/kernel", "shape": [4608, 4096], "dtype": "float32", "quantization": {"min": -0.16986925344841153, "scale": 0.001306686564987781, "dtype": "uint8"}}, {"name": "dense_12/bias", "shape": [4096], "dtype": "float32", "quantization": {"min": -0.049821872731634215, "scale": 0.0003922982104853088, "dtype": "uint8"}}, {"name": "dense_13/kernel", "shape": [4096, 4096], "dtype": "float32", "quantization": {"min": -0.13221221811631148, "scale": 0.0011017684843025956, "dtype": "uint8"}}, {"name": "dense_13/bias", "shape": [4096], "dtype": "float32", "quantization": {"min": -0.04295625734855147, "scale": 0.00038699330944640966, "dtype": "uint8"}}, {"name": "dense_14/kernel", "shape": [4096, 1000], "dtype": "float32", "quantization": {"min": -0.1314341117354, "scale": 0.0009808515801149255, "dtype": "uint8"}}, {"name": "dense_14/bias", "shape": [1000], "dtype": "float32", "quantization": {"min": -0.02553926265853293, "scale": 0.0002746157275111068, "dtype": "uint8"}}, {"name": "dense_15/kernel", "shape": [1000, 5], "dtype": "float32", "quantization": {"min": -0.139989052186994, "scale": 0.0009523064774625442, "dtype": "uint8"}}, {"name": "dense_15/bias", "shape": [5], "dtype": "float32", "quantization": {"min": -0.012629267989712603, "scale": 0.00011803054195993087, "dtype": "uint8"}}]}]}